laba11/app/controllers/pages_controller.rb

SELECT "rezults".* FROM "rezults"
---
  def cached
    result = Rezult.all.map{|var| [in: var.input, out: var.output] }