laba11/app/models/rezult.rb

    def generate_rez(input_str,input_count)
      if exists?(input:input_str)
        message = "from db"
        show_array = eval(find_by(input: input_str).output)
      else
        message = "from server"
        show_array = calculate(input_count,input_str.split(" ").map(&:to_i))
---
SELECT "rezults".* FROM "rezults" WHERE "rezults"."input" = ? LIMIT ?  [["input", "1 2 3 4 5"], ["LIMIT", 1]]