laba12/app/controllers/pages_controller.rb

SELECT "users".* FROM "users"
---
  def userlist
      res = User.all.map { |inst| { emeil: inst.emeil } }