laba12/app/controllers/sessions_controller.rb

  def create
    user = User.find_by_emeil(params[:emeil])
---
SELECT "users".* FROM "users" WHERE "users"."emeil" = ? LIMIT ?  [["emeil", "test1@main.ru"], ["LIMIT", 1]]