laba12/app/controllers/users_controller.rb

INSERT INTO "users" ("emeil", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "emeil" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["emeil", "test11@main.ru"], ["password_digest", "$2a$12$4SoNnkbIzeVfBjw4l4uBwO0/H7N8xnE6badKeQ48K8JCFcT0CoRnK"], ["updated_at", "2020-12-03 14:40:15.727907"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 6]]
---
  def destroy
    session[:user_id] = nil
    @user.destroy